In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from env import get_db_url

In [16]:
query = """
SELECT customer_id, monthly_charges, tenure, total_charges FROM customers
JOIN contract_types USING (contract_type_id)
WHERE contract_type_id = 3;
"""
df = pd.read_sql(query, get_db_url("telco_churn"))
df.head()

  customer_id  monthly_charges  tenure total_charges
0  0013-SMEOE           109.70      71       7904.25
1  0014-BMAQU            84.65      63        5377.8
2  0016-QLJIS            90.45      65        5957.9
3  0017-DINOC            45.20      54       2460.55
4  0017-IUDMW           116.80      72       8456.75

In [17]:
df.total_charges = df.total_charges.str.strip().replace('', np.nan).astype(float)

In [23]:
df = df.dropna() 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 4 columns):
customer_id        1695 non-null object
monthly_charges    1695 non-null float64
tenure             1695 non-null int64
total_charges      1685 non-null float64
dtypes: float64(2), int64(1), object(1)
memory usage: 53.1+ KB

In [24]:
def get_data_from_mysql():
    query = """
    SELECT customer_id, monthly_charges, tenure, total_charges FROM customers
    JOIN contract_types USING (contract_type_id)
    WHERE contract_type_id = 3;
    """
    df = pd.read_sql(query, get_db_url("telco_churn"))
    return df

In [25]:
get_data_from_mysql()

     customer_id  monthly_charges  tenure total_charges
0     0013-SMEOE           109.70      71       7904.25
1     0014-BMAQU            84.65      63        5377.8
2     0016-QLJIS            90.45      65        5957.9
3     0017-DINOC            45.20      54       2460.55
4     0017-IUDMW           116.80      72       8456.75
...          ...              ...     ...           ...
1690  9964-WBQDJ            24.40      71        1725.4
1691  9972-EWRJS            19.25      67        1372.9
1692  9975-GPKZU            19.75      46         856.5
1693  9993-LHIEB            67.85      67       4627.65
1694  9995-HOTOH            59.00      63        3707.6

[1695 rows x 4 columns]

In [41]:
def wrangle_telco():
    df = get_data_from_mysql()
    df.total_charges = df.total_charges.str.strip().replace('', np.nan).astype(float)
    df = df.dropna()
    return df

In [42]:
s = wrangle_telco()

In [46]:
s.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1685 entries, 0 to 1694
Data columns (total 4 columns):
customer_id        1685 non-null object
monthly_charges    1685 non-null float64
tenure             1685 non-null int64
total_charges      1685 non-null float64
dtypes: float64(2), int64(1), object(1)
memory usage: 65.8+ KB

In [47]:
import sklearn.preprocessing

In [48]:
import pydataset